dependencies/OpenFOAM/tutorials/verificationAndValidation/turbulenceModels/planeChannel/setups.orig/common/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(bottom|top)"
    {
        type            nutLowReWallFunction;
        value           $internalField;
    }

    "(inlet|outlet)"
    {
        type            cyclic;
    }

    leftAndRight
    {
        type            empty;
    }
}


// ************************************************************************* //
